Revit 2027 API
NumberingSchema.Priority Property
 The priority for this numbering schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Priority { get; set; }
Public Property Priority As Integer
	Get
	Set
public:
property int Priority {
	int get ();
	void set (int value);
}
member Priority : int with get, set
Property Value
Int32
Remarks
 If two numbering schemas have the same scope and the same output parameter only the one with the highest priority will be executed. If two schemas have the same priority, the same scope and the same output parameter one of them will be selected as the executing schema.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace